alexandergrib/ESP32_temp_and_Humidity_monitor/controller/controller.ino
#include <Arduino.h>
#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <Preferences.h>
#include <time.h>
#include "protocol.h"

using namespace proto;

static constexpr uint32_t SERIAL_BAUD = 460800;

Preferences prefs;

#ifndef LED_BUILTIN
static constexpr uint8_t STATUS_LED_PIN = 2;
#else
static constexpr uint8_t STATUS_LED_PIN = LED_BUILTIN;
#endif

static constexpr uint32_t STATUS_LED_PERIOD_MS = 1000;
static constexpr uint32_t STATUS_LED_ON_MS = 80;
static constexpr uint32_t MIN_REPORT_SLOT_GAP_MS = 250;
static constexpr uint32_t OFFLINE_REPROBE_MS = 2000;
static constexpr uint32_t OTA_ACK_TIMEOUT_MS = 1500;
static constexpr uint8_t OTA_MAX_RETRIES = 3;
static constexpr uint32_t RSSI_CACHE_MAX_AGE_MS = 1500;
static constexpr size_t RSSI_CACHE_SLOTS = 16;
static constexpr uint8_t ESPNOW_CATEGORY_CODE = 127;
static constexpr uint8_t ESPNOW_ELEMENT_ID = 221;
static constexpr uint8_t ESPNOW_TYPE = 4;
static constexpr uint8_t ESPRESSIF_OUI[3] = {0x18, 0xFE, 0x34};

struct NodeRecord {
    bool used = false;
    uint32_t nodeId = 0;
    uint8_t mac[6] = {0};
    char name[16] = {0};
    uint32_t lastSeenMs = 0;
    uint32_t reportIntervalMs = DEFAULT_REPORT_MS;
    float lastTempC = NAN;
    float lastHumidity = NAN;
    uint8_t sensorOk = 0;
    uint8_t fwMajor = 0;
    uint8_t fwMinor = 0;
    int8_t lastRssiDbm = 0;
    bool heaterEnabled = false;
    bool otaReady = false;
    uint16_t sampleRateHz = DEFAULT_SAMPLE_RATE_HZ;
    float tempOffsetC = 0.0f;
    uint32_t nextReportDelayMs = 0;
    uint32_t lastDeliveredReadingSeq = 0;
};

struct RssiSample {
    bool valid = false;
    uint8_t mac[6] = {0};
    int8_t rssiDbm = 0;
    uint32_t seenAtMs = 0;
};

static constexpr size_t MAX_NODES = 32;
NodeRecord nodes[MAX_NODES];
uint32_t nextNodeId = 1;
bool bindWindowOpen = true;
uint32_t bindWindowEndsAt = 0;
uint32_t txSeq = 1;
uint32_t lastLedBeatAt = 0;
bool statusLedOn = false;
bool streamEnabled = false;
bool promptShown = false;
bool controllerTimeValid = false;
time_t controllerBaseEpoch = 0;
uint32_t controllerBaseMillis = 0;
RssiSample rssiSamples[RSSI_CACHE_SLOTS];
size_t nextRssiSampleSlot = 0;

struct OtaSession {
    bool active = false;
    bool awaitingAck = false;
    uint32_t nodeId = 0;
    uint8_t mac[6] = {0};
    uint32_t totalSize = 0;
    uint32_t expectedCrc32 = 0;
    uint32_t nextOffset = 0;
    uint32_t bytesReceived = 0;
    OtaPhase pendingPhase = OTA_PHASE_BEGIN;
    uint32_t pendingOffset = 0;
    uint16_t pendingLen = 0;
    uint8_t pendingData[OTA_CHUNK_BYTES] = {0};
    uint32_t ackDeadlineMs = 0;
    uint8_t retryCount = 0;
} otaSession;

void handleIncomingPacket(const uint8_t* mac, const uint8_t* data, int len, int8_t rssiDbm = 0);
void logSendStatus(esp_now_send_status_t status);
void rebuildReportSchedule();
void pushSchedulesToAllNodes();
void handleOtaAck(const uint8_t* mac, const OtaAck& ack);
void handleRenameAck(const uint8_t* mac, const RenameAck& ack);
void retryPendingOtaFrame();
void onPromiscuousPacket(void* buf, wifi_promiscuous_pkt_type_t type);

bool timeReached(uint32_t now, uint32_t target) {
    return static_cast<int32_t>(now - target) >= 0;
}

uint32_t normalizeReportInterval(uint32_t ms) {
    return max(ms, MIN_REPORT_MS);
}

uint16_t normalizeSampleRateHz(uint32_t hz) {
    return static_cast<uint16_t>(constrain(hz, MIN_SAMPLE_RATE_HZ, MAX_SAMPLE_RATE_HZ));
}

String sanitizeNodeName(String name) {
    name.trim();
    String sanitized;
    sanitized.reserve(15);
    for (size_t i = 0; i < name.length() && sanitized.length() < 15; ++i) {
        const char c = name[i];
        if ((c >= 'A' && c <= 'Z') ||
            (c >= 'a' && c <= 'z') ||
            (c >= '0' && c <= '9') ||
            c == '_' || c == '-' || c == ' ') {
            sanitized += c;
        }
    }
    sanitized.trim();
    if (sanitized.length() == 0) sanitized = "satellite";
    return sanitized;
}

bool nodeNeedsFastProbe(const NodeRecord& node, uint32_t now) {
    if (!node.used) return false;
    if (node.lastSeenMs == 0) return true;

    const uint32_t staleAfterMs = max<uint32_t>(OFFLINE_REPROBE_MS * 2, normalizeReportInterval(node.reportIntervalMs) * 3);
    return now - node.lastSeenMs >= staleAfterMs;
}

uint8_t rssiToSignalPercent(int8_t rssiDbm) {
    if (rssiDbm >= 0) return 0;
    if (rssiDbm <= -90) return 0;
    if (rssiDbm >= -50) return 100;
    return static_cast<uint8_t>(((static_cast<int16_t>(rssiDbm) + 90) * 100) / 40);
}

const char* otaStatusToString(uint8_t status) {
    switch (status) {
        case OTA_STATUS_OK: return "ok";
        case OTA_STATUS_REJECTED: return "rejected";
        case OTA_STATUS_NOT_ACTIVE: return "not_active";
        case OTA_STATUS_OFFSET_MISMATCH: return "offset_mismatch";
        case OTA_STATUS_WRITE_FAILED: return "write_failed";
        case OTA_STATUS_END_FAILED: return "end_failed";
        case OTA_STATUS_CRC_MISMATCH: return "crc_mismatch";
        case OTA_STATUS_BUSY: return "busy";
        case OTA_STATUS_NOT_READY: return "not_ready";
        default: return "unknown";
    }
}

void clearOtaSession() {
    otaSession = OtaSession{};
}

time_t controllerNow() {
    if (!controllerTimeValid) return 0;
    return controllerBaseEpoch + (millis() - controllerBaseMillis) / 1000;
}

void setControllerTime(time_t epochSeconds) {
    controllerTimeValid = true;
    controllerBaseEpoch = epochSeconds;
    controllerBaseMillis = millis();
    prefs.putBool("timeValid", true);
    prefs.putULong64("timeEpoch", static_cast<uint64_t>(epochSeconds));
}

String formatControllerTimeIso(time_t epochSeconds) {
    struct tm tmUtc{};
    gmtime_r(&epochSeconds, &tmUtc);
    char buf[25];
    snprintf(
        buf,
        sizeof(buf),
        "%04d-%02d-%02dT%02d:%02d:%02dZ",
        tmUtc.tm_year + 1900,
        tmUtc.tm_mon + 1,
        tmUtc.tm_mday,
        tmUtc.tm_hour,
        tmUtc.tm_min,
        tmUtc.tm_sec
    );
    return String(buf);
}

String withControllerTime(const String& json) {
    if (!controllerTimeValid) return json;

    const int insertAt = json.lastIndexOf('}');
    if (insertAt < 0) return json;

