alexandergrib/ESP32_temp_and_Humidity_monitor/controller/controller.ino
void sendNodeConfig(size_t idx) {
    if (idx >= MAX_NODES || !nodes[idx].used) return;
    sendConfig(
        nodes[idx].nodeId,
        nodes[idx].reportIntervalMs,
        nodes[idx].nextReportDelayMs,
        nodes[idx].tempOffsetC,
        nodes[idx].heaterEnabled,
        nodes[idx].otaReady,
        nodes[idx].sampleRateHz
    );
}

void setNodeOtaReady(size_t idx, bool enabled, bool pushConfig = true) {
    if (idx >= MAX_NODES || !nodes[idx].used) return;
    nodes[idx].otaReady = enabled;
    if (pushConfig) {
        sendNodeConfig(idx);
    }
    printJsonEvent(
        "{\"event\":\"ota_ready\",\"node_id\":" + String(nodes[idx].nodeId) +
        ",\"enabled\":" + String(enabled ? "true" : "false") + "}",
        true
    );
}

void sendRename(uint32_t nodeId, const String& requestedName) {
    int idx = findNodeById(nodeId);
    if (idx < 0) return;

    const String sanitizedName = sanitizeNodeName(requestedName);
    RenameSet msg{};
    fillHeader(msg.header, MSG_RENAME_SET, txSeq++, nodeId, millis());
    sanitizedName.toCharArray(msg.nodeName, sizeof(msg.nodeName));
    ensurePeer(nodes[idx].mac);
    esp_now_send(nodes[idx].mac, reinterpret_cast<const uint8_t*>(&msg), sizeof(msg));
}

void sendReadingAck(size_t idx, uint32_t readingSequence) {
    if (idx >= MAX_NODES || !nodes[idx].used) return;
    ReadingAck ack{};
    fillHeader(ack.header, MSG_READING_ACK, txSeq++, nodes[idx].nodeId, millis());
    ack.readingSequence = readingSequence;
    ack.accepted = 1;
    ensurePeer(nodes[idx].mac);
    esp_now_send(nodes[idx].mac, reinterpret_cast<const uint8_t*>(&ack), sizeof(ack));
}

void armOtaAckWait(OtaPhase phase, uint32_t offset = 0, uint16_t len = 0, const uint8_t* data = nullptr) {
    otaSession.awaitingAck = true;
    otaSession.pendingPhase = phase;
    otaSession.pendingOffset = offset;
    otaSession.pendingLen = len;
    if (data != nullptr && len > 0) {
        memcpy(otaSession.pendingData, data, len);
    }
    otaSession.retryCount = 0;
    otaSession.ackDeadlineMs = millis() + OTA_ACK_TIMEOUT_MS;
}

void sendOtaBeginFrame() {
    OtaBegin msg{};
    fillHeader(msg.header, MSG_OTA_BEGIN, txSeq++, otaSession.nodeId, millis());
    msg.totalSize = otaSession.totalSize;
    msg.expectedCrc32 = otaSession.expectedCrc32;
    ensurePeer(otaSession.mac);
    esp_now_send(otaSession.mac, reinterpret_cast<const uint8_t*>(&msg), sizeof(msg));
}

void sendOtaChunkFrame(uint32_t offset, const uint8_t* data, uint16_t len) {
    OtaChunk msg{};
    fillHeader(msg.header, MSG_OTA_CHUNK, txSeq++, otaSession.nodeId, millis());
    msg.offset = offset;
    msg.dataLen = len;
    memcpy(msg.data, data, len);
    ensurePeer(otaSession.mac);
    esp_now_send(otaSession.mac, reinterpret_cast<const uint8_t*>(&msg), sizeof(msg));
}

void sendOtaEndFrame() {
    OtaEnd msg{};
    fillHeader(msg.header, MSG_OTA_END, txSeq++, otaSession.nodeId, millis());
    msg.totalSize = otaSession.totalSize;
    msg.expectedCrc32 = otaSession.expectedCrc32;
    ensurePeer(otaSession.mac);
    esp_now_send(otaSession.mac, reinterpret_cast<const uint8_t*>(&msg), sizeof(msg));
}

bool beginOta(uint32_t nodeId, uint32_t totalSize, uint32_t expectedCrc32) {
    if (otaSession.active) return false;

    int idx = findNodeById(nodeId);
    if (idx < 0) return false;
    if (!nodes[idx].otaReady) return false;

    otaSession.active = true;
    otaSession.nodeId = nodeId;
    otaSession.totalSize = totalSize;
    otaSession.expectedCrc32 = expectedCrc32;
    memcpy(otaSession.mac, nodes[idx].mac, sizeof(otaSession.mac));

    sendOtaBeginFrame();
    armOtaAckWait(OTA_PHASE_BEGIN);
    printJsonEvent(
        "{\"event\":\"ota_begin_sent\",\"node_id\":" + String(nodeId) +
        ",\"size\":" + String(totalSize) +
        ",\"crc32\":\"" + String(expectedCrc32, HEX) + "\"}"
    );
    return true;
}

bool queueOtaChunk(uint32_t offset, const uint8_t* data, uint16_t len) {
    if (!otaSession.active || otaSession.awaitingAck) return false;
    if (offset != otaSession.nextOffset) return false;
    if (len == 0 || len > OTA_CHUNK_BYTES) return false;

    sendOtaChunkFrame(offset, data, len);
    armOtaAckWait(OTA_PHASE_CHUNK, offset, len, data);
    return true;
}

bool finishOta() {
    if (!otaSession.active || otaSession.awaitingAck) return false;
    if (otaSession.nextOffset != otaSession.totalSize) return false;

    sendOtaEndFrame();
    armOtaAckWait(OTA_PHASE_END);
    return true;
}

void abortOta(const char* reason) {
    if (otaSession.active) {
        int idx = findNodeById(otaSession.nodeId);
        if (idx >= 0) {
            setNodeOtaReady(static_cast<size_t>(idx), false);
        }
    }
    printJsonEvent(String("{\"event\":\"ota_aborted\",\"reason\":\"") + reason + "\"}");
    clearOtaSession();
}

void retryPendingOtaFrame() {
    switch (otaSession.pendingPhase) {
        case OTA_PHASE_BEGIN:
            sendOtaBeginFrame();
            break;
        case OTA_PHASE_CHUNK:
            sendOtaChunkFrame(otaSession.pendingOffset, otaSession.pendingData, otaSession.pendingLen);
            break;
        case OTA_PHASE_END:
            sendOtaEndFrame();
            break;
    }
    otaSession.retryCount++;
    otaSession.ackDeadlineMs = millis() + OTA_ACK_TIMEOUT_MS;
}

size_t countActiveNodes() {
    size_t count = 0;
    for (const NodeRecord& node : nodes) {
        if (node.used) ++count;
    }
    return count;
}

void rebuildReportSchedule() {
    size_t activeCount = countActiveNodes();
    if (activeCount == 0) return;
    uint32_t cycleMs = activeCount * MIN_REPORT_SLOT_GAP_MS;
    for (const NodeRecord& node : nodes) {
        if (!node.used) continue;
        cycleMs = max(cycleMs, normalizeReportInterval(node.reportIntervalMs));
    }
    const uint32_t spacingMs = max(MIN_REPORT_SLOT_GAP_MS, cycleMs / activeCount);
    uint32_t offsetMs = 0;
    for (NodeRecord& node : nodes) {
        if (!node.used) continue;
        node.reportIntervalMs = cycleMs;
        node.nextReportDelayMs = offsetMs;
        offsetMs += spacingMs;
    }
}

void pushSchedulesToAllNodes() {
    for (size_t i = 0; i < MAX_NODES; ++i) {
        if (!nodes[i].used) continue;
        sendNodeConfig(i);
    }
}

void handleBindRequest(const uint8_t* mac, const BindRequest& req) {
    int idx = findNodeByMac(mac);
    bool isNewNode = false;
    if (idx < 0) {
        if (!bindWindowOpen || millis() > bindWindowEndsAt) {
            return;
        }
        idx = allocateNodeSlot();
        if (idx < 0) {
            printJsonEvent("{\"event\":\"bind_rejected\",\"reason\":\"node_table_full\"}");
            return;
        }
        isNewNode = true;
        nodes[idx].used = true;
        nodes[idx].nodeId = nextNodeId++;
        memcpy(nodes[idx].mac, mac, 6);
        prefs.putUInt("nextNodeId", nextNodeId);
    }

    sanitizeNodeName(String(req.nodeName)).toCharArray(nodes[idx].name, sizeof(nodes[idx].name));
    nodes[idx].fwMajor = req.fwMajor;
    nodes[idx].fwMinor = req.fwMinor;
    if (isNewNode) {
        nodes[idx].reportIntervalMs = DEFAULT_REPORT_MS;
        nodes[idx].sampleRateHz = DEFAULT_SAMPLE_RATE_HZ;
    }
    nodes[idx].lastSeenMs = millis();
    saveNode(idx);
    rebuildReportSchedule();
    sendBindAck(mac, nodes[idx]);
    pushSchedulesToAllNodes();

    printJsonEvent(
        "{\"event\":\"node_bound\",\"node_id\":" + String(nodes[idx].nodeId) +
        ",\"name\":\"" + String(nodes[idx].name) +
        "\",\"mac\":\"" + macToString(mac) + "\"}"
    );
}

void handleReading(const uint8_t* mac, const Reading& msg, int8_t rssiDbm) {
    int idx = findNodeByMac(mac);
    if (idx < 0) return;
    nodes[idx].lastSeenMs = millis();
    if (nodes[idx].lastDeliveredReadingSeq == msg.header.sequence) {
        sendReadingAck(static_cast<size_t>(idx), msg.header.sequence);
        return;
    }
    nodes[idx].lastTempC = msg.temperatureC;
    nodes[idx].lastHumidity = msg.humidityPct;
    nodes[idx].sensorOk = msg.sensorOk;
    nodes[idx].fwMajor = msg.reserved[0];
    nodes[idx].fwMinor = msg.reserved[1];
    nodes[idx].lastRssiDbm = rssiDbm;
    nodes[idx].lastDeliveredReadingSeq = msg.header.sequence;
    sendReadingAck(static_cast<size_t>(idx), msg.header.sequence);

    printJsonEvent(
        "{\"event\":\"reading\",\"node_id\":" + String(nodes[idx].nodeId) +
        ",\"name\":\"" + String(nodes[idx].name) +
        "\",\"temperature_c\":" + String(msg.temperatureC, 2) +
        ",\"humidity_pct\":" + String(msg.humidityPct, 2) +
        ",\"sensor_ok\":" + String(msg.sensorOk ? "true" : "false") +
        ",\"fw_version\":\"" + String(nodes[idx].fwMajor) + "." + String(nodes[idx].fwMinor) + "\"" +
        ",\"rssi_dbm\":" + String(nodes[idx].lastRssiDbm) +
        ",\"signal_pct\":" + String(rssiToSignalPercent(nodes[idx].lastRssiDbm)) +
        ",\"mac\":\"" + macToString(mac) + "\"}"
    );
}

void handleConfigAck(const uint8_t* mac, const ConfigAck& msg) {
    int idx = findNodeByMac(mac);
    if (idx < 0) return;
    nodes[idx].lastSeenMs = millis();
    nodes[idx].reportIntervalMs = normalizeReportInterval(msg.reportIntervalMs);
    nodes[idx].nextReportDelayMs = msg.nextReportDelayMs;
    nodes[idx].tempOffsetC = msg.tempOffsetC;
    nodes[idx].heaterEnabled = msg.heaterEnabled != 0;
    nodes[idx].otaReady = msg.otaReady != 0;
    nodes[idx].sampleRateHz = normalizeSampleRateHz(msg.sampleRateHz);
    saveNode(idx);
    printJsonEvent(
        "{\"event\":\"config_ack\",\"node_id\":" + String(nodes[idx].nodeId) +
        ",\"report_interval_ms\":" + String(nodes[idx].reportIntervalMs) +
        ",\"next_report_delay_ms\":" + String(nodes[idx].nextReportDelayMs) +
        ",\"temp_offset_c\":" + String(nodes[idx].tempOffsetC, 2) +
        ",\"heater_enabled\":" + String(nodes[idx].heaterEnabled ? "true" : "false") +
        ",\"ota_ready\":" + String(nodes[idx].otaReady ? "true" : "false") +
        ",\"sample_rate_hz\":" + String(nodes[idx].sampleRateHz) +
        ",\"applied\":" + String(msg.applied ? "true" : "false") + "}"
    );
}

void handleRenameAck(const uint8_t* mac, const RenameAck& ack) {
    int idx = findNodeByMac(mac);
    if (idx < 0) return;

